# Week 15 ETL Project
Angela Spencer

Clarine Esperance

Ayesha Patel

In [1]:
#Dependencies
import pandas as pd
import numpy as np
import requests
import json
import random

In [2]:
#imports for ETL
import psycopg2
from password import password 
#You can pass a sqlalchemy engine for a postgresql database 
# https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_introduction.htm
from sqlalchemy import create_engine
from sqlalchemy import inspect

For this project we used data from the http://audiodb.com which uses a JSON API and contains information on over 53,000 artists. In order to pull a managable amount of data, we created a list of randomly generated numbers within the range of available artist IDs. This list was used to loop through the database URLs and pull information on all available artist IDs in the list. From this information we created a new list with artist names corresponding to the aritst IDs. With the new list of artist IDs we were able to loop through database URLs to populate a dictionary with data, including: artist ID, artist name, gender, number of members, music style/genre, year formed, year disbanded, and location. From this dictionary we created a dataframe in order to view and clean the information.

#### Generate Dictionary of Artist Data from Web API

In [3]:
# Find a code to get all the artists from this api
# https://www.theaudiodb.com/api_guide.php
# theaudiodb.com/api/v1/json/1/search.php?s=coldplay

# empty list to be populated with artist info
artist_names = []

audio_data = {'artist_id':[],
               'artist_name':[],
               'gender':[],
               'member_count':[],
               'style':[], 
               'genre':[],
               'year_formed':[],
               'year_disbanded':[],
               'country_code':[],
               'label':[]}

In [4]:
#generate random numbers in the range of available artist IDs
#used to populate artist_names list
random.seed(66)
random_nums = [random.randint(100000, 170000) for i in range(1500)]

#test with known IDs and intentional errors
#random_nums = [112024, 0, 100000, 114364]

In [5]:
#this artist list uses a random number generator to test the database for artist IDs
#if an ID corresponds to an artist, it append the artist's information to info lists
#create a base url
#example: https://theaudiodb.com/api/v1/json/2/artist.php?i=112024
id_url = "https://theaudiodb.com/api/v1/json/2/artist.php?i="

#create a loop that uses random numbers list
for num in random_nums:
    unique_url = id_url + f'{num}'
    
    #call api url
    request = requests.get(unique_url)
    
    #for each attempt try to convert information to json
    try:
        #convert to json
        info = request.json()
        
    #exception json decode error
    #https://docs.python.org/3/tutorial/controlflow.html
    except json.JSONDecodeError:
        #end this iteration and continue new iteration of for loop
        continue
    #if json conversion successful then
    #try to create a variable for single artist to reference later
    try:
        artist = info['artists'][0]['strArtist']
        
    #TypeError exception if url responds with {'artists': None}
    except (TypeError):
        continue
        
    #if the artist is not already in the list then 
    if artist not in artist_names:
        
        #populate artist_names list using info(json)
        #response-> {'artists': [{'idArtist': '114364', 'strArtist': 'Beyoncé', ...
        #dictionary{'artists':['{dictionary}']}
        audio_data['artist_id'].append(info['artists'][0]['idArtist'])
        audio_data['artist_name'].append(info['artists'][0]['strArtist'])
        audio_data['gender'].append(info['artists'][0]["strGender"])
        audio_data['member_count'].append(info['artists'][0]["intMembers"])
        audio_data['style'].append(info['artists'][0]["strStyle"])
        audio_data['genre'].append(info['artists'][0]["strGenre"])
        audio_data['year_formed'].append(info['artists'][0]["intFormedYear"])
        audio_data['year_disbanded'].append(info['artists'][0]["strDisbanded"])
        audio_data['country_code'].append(info['artists'][0]['strCountryCode'])
        audio_data['label'].append(info['artists'][0]['strLabel'])

#### Convert Dictionary to DataFrame

In [6]:
audio_df = pd.DataFrame(audio_data)
audio_df

,artist_id,artist_name,gender,member_count,style,genre,year_formed,year_disbanded,country_code,label
0,140892,Ice Nine Kills,Male,4,,Metalcore,2006,None,US,None
1,132276,Savage,Male,1,Electronic,Synthpop,1983,None,IT,None
2,158416,Jason Hawk Harris,None,None,None,,0,None,,None
3,133565,Violent Work of Art,Mixed,4,,Industrial Metal,1994,None,SE,None
4,112476,James Horner,Male,1,Classical,OST,1979,None,US,None
...,...,...,...,...,...,...,...,...,...,...
1162,113477,Terror,Male,5,Rock/Pop,Hardcore,2000,None,US,None
1163,157114,DJ Baur,None,None,None,,0,None,,None
1164,114531,Toots & The Maytals,,1,Reggae,Reggae,1963,None,JM,None
1165,117428,Gendai Kano,Male,1,Classical,Musical,1938,None,JP,None
1166,160496,24kGoldn,Male,1,Urban/R&B,Hip-Hop,2016,None,US,Columbia

# Preprocessing

#### Converting to Null Values
- Cleaning the data to ensure that all null values are represented in the same way.  
- All missing values (NaN, Null, None, and empty string) were replaced with 'None' to indicate that there is no available data.

In [7]:
#sum of null values in each column
print(audio_df.isnull().sum())

#style has more null values than genre, drop style column
audio_df.drop(['style'], axis=1, inplace=True)

artist_id            0
artist_name          0
gender             350
member_count       350
style              356
genre               62
year_formed        153
year_disbanded    1097
country_code         0
label             1102
dtype: int64

In [8]:
#convert empty strings and null values to NaN
audio_df.replace({'0':'None',
                  0:'None', 
                  None:'None', 
                  '':'None',
                  np.nan:'None',
                  'NaN':'None'}, inplace = True)

In [9]:
audio_df.isnull().sum()

artist_id         0
artist_name       0
gender            0
member_count      0
genre             0
year_formed       0
year_disbanded    0
country_code      0
label             0
dtype: int64

#### Converting datatypes

Checking the datatypes.
Converting artist_id, member_count, year_formed, year_disbanded columns from object datatypes to numeric datatypes (floats or integer) using pd.to_numeric. Pandas.to_numeric is a function that converts arugments to numeric values.

In [10]:
audio_df.dtypes

artist_id         object
artist_name       object
gender            object
member_count      object
genre             object
year_formed       object
year_disbanded    object
country_code      object
label             object
dtype: object

In [11]:
#convert dtypes from string to numeric dtypes
audio_df[['artist_id', 
          'member_count', 
          'year_formed', 
          'year_disbanded']] = audio_df[['artist_id', 
                                         'member_count', 
                                         'year_formed', 
                                         'year_disbanded']].apply(pd.to_numeric,errors='coerce',downcast='integer')
#convert float to integer
audio_df[['artist_id', 
          'member_count', 
          'year_formed', 
          'year_disbanded']] = audio_df[['artist_id', 
                                         'member_count', 
                                         'year_formed', 
                                         'year_disbanded']].convert_dtypes(convert_integer=True, convert_string=False)
audio_df.dtypes

artist_id          Int32
artist_name       object
gender            object
member_count       Int64
genre             object
year_formed        Int64
year_disbanded     Int64
country_code      object
label             object
dtype: object

Pd.to_datetime is used to convert the year_formed and year_disbanded columns. Nanoseconds that were included in the year_formed and year_disbanded were removed to just have the dates without the timestamp.

In [12]:
#convert year_disbanded and year_formed to datetime

pd.to_datetime(audio_df['year_formed'], 
               format= '%Y', errors='coerce')

0      2006-01-01
1      1983-01-01
2             NaT
3      1994-01-01
4      1979-01-01
          ...
1162   2000-01-01
1163          NaT
1164   1963-01-01
1165   1938-01-01
1166   2016-01-01
Name: year_formed, Length: 1167, dtype: datetime64[ns]

Converted NaN to a numeric value to assist with the querying for postgres. Missing values were not dropped from the dataframe because when they are dropped, it removes a lot  of the data points. We also do not have enough information regarding the data to know if the missing values are intentional. For example, if and artists/artist group is missing information in the genre column, it may be that they are in multiple genre categories. Also, since this database is to be used by multiple people, we want to keep the data points so that the data can be used in ways others see fit

In [13]:
#convert NaN created by numeric conversion into 0 in order to query later
audio_df.replace({np.nan:0}, inplace = True)
audio_df

,artist_id,artist_name,gender,member_count,genre,year_formed,year_disbanded,country_code,label
0,140892,Ice Nine Kills,Male,4,Metalcore,2006,0,US,None
1,132276,Savage,Male,1,Synthpop,1983,0,IT,None
2,158416,Jason Hawk Harris,None,0,None,0,0,None,None
3,133565,Violent Work of Art,Mixed,4,Industrial Metal,1994,0,SE,None
4,112476,James Horner,Male,1,OST,1979,0,US,None
...,...,...,...,...,...,...,...,...,...
1162,113477,Terror,Male,5,Hardcore,2000,0,US,None
1163,157114,DJ Baur,None,0,None,0,0,None,None
1164,114531,Toots & The Maytals,None,1,Reggae,1963,0,JM,None
1165,117428,Gendai Kano,Male,1,Musical,1938,0,JP,None
1166,160496,24kGoldn,Male,1,Hip-Hop,2016,0,US,Columbia

#### Feature Engineering
Creating a new colum of expanded country names corresponding to country codes. A csv file of alpha2_code.csv was created, which contains, the country name and the country's initials in place of the country code. The csv file was turned into a dataframe called countries_df. Countries_df was merged into the audio_df using the function pd.merge.

In [14]:
audio_df['country_code'].value_counts()

US      291
None    221
GB      111
DE       65
FR       61
       ...
MY        1
CO        1
GH        1
IR        1
SW        1
Name: country_code, Length: 72, dtype: int64

In [15]:
#import csv containing standard 2 digit alpha codes for countries
alpha2_codes = pd.read_csv('alpha2_codes.csv')

#convert alpha2 codes to dataframe
countries_df = pd.DataFrame(alpha2_codes)
countries_df

       country_name country_code
0       Afghanistan          AF
1           Albania          AL
2           Algeria          DZ
3    American Samoa          AS
4           Andorra          AD
..              ...          ...
245           Yemen           YE
246          Zambia           ZM
247        Zimbabwe           ZW
248   Aland Islands           AX
249            None         None

[250 rows x 2 columns]

In [16]:
#merge list of country codes onto audio_df to create new column of country names
audio_df = pd.merge(audio_df, countries_df)

##### Drop duplicate artist_ids and country_codes

Ensuring that artists_id and countries are not duplicated in the dataframe. After duplicates were dropped, the index of the dataframe was reset.

In [17]:
#drop 5 duplicate artist_ids that were discovered
audio_df.drop_duplicates(subset=['artist_id'], inplace=True)
audio_df.reset_index(inplace=True, drop=True)

In [18]:
#countries_df contains only unique values
# drop two discovered codes that had null values
location_df = countries_df.drop([249, 152])
location_df.reset_index(inplace = True, drop=True)

## Creating Tables

The larger dataframe, audio_df, was split into multiple dataframes to correspond to the three database tables: artist_df, info_df, and location_df.

In [19]:
# split data into multiple data frames for tables
artist_df = audio_df.iloc[:,:3]
artist_df

      artist_id                            artist_name  gender
0        140892                         Ice Nine Kills    Male
1        112476                           James Horner    Male
2        160023                        Mickey Petralia    Male
3        169251                               3D Natee  Female
4        150340  Dick Schory's New Percussion Ensemble    Male
...         ...                                    ...     ...
1090     130853                          İlhan Erşahin    None
1091     167192                  Veronika Povilioniene  Female
1092     149602                                    李雲迪    Male
1093     167328                                ريم بنا  Female
1094     155862                            Ana Vidović  Female

[1095 rows x 3 columns]

In [20]:
info_df = audio_df.iloc[:, [0,7,4,3,5,6,8]]
info_df

,artist_id,country_code,genre,member_count,year_formed,year_disbanded,label
0,140892,US,Metalcore,4,2006,0,None
1,112476,US,OST,1,1979,0,None
2,160023,US,None,1,0,0,None
3,169251,US,Rap,1,0,0,None
4,150340,US,Acoustic,1,1958,0,None
...,...,...,...,...,...,...,...
1090,130853,TR,None,1,1965,0,None
1091,167192,LT,Folk,1,1987,0,None
1092,149602,CN,Pianist,1,0,0,None
1093,167328,PS,World/Ethnic,1,0,0,None
1094,155862,HR,Instrumental,1,0,0,None

In [21]:
location_df

       country_name country_code
0       Afghanistan          AF
1           Albania          AL
2           Algeria          DZ
3    American Samoa          AS
4           Andorra          AD
..              ...          ...
243  Western Sahara           EH
244           Yemen           YE
245          Zambia           ZM
246        Zimbabwe           ZW
247   Aland Islands           AX

[248 rows x 2 columns]

## Connecting to PostgreSQL

A connection to sql to PostgreSQL was created using psycopg2 and sqlalchemy. All of the dataframes were then converted to sql tables: artist, artist_info, location_info. To form this connection and create the sql tables, a function was created called create_table, which will take a dataframe and a table name. Psycopg2 and SQLalchemy forms the connection. The parameters in the function are used to create a table in the audio_data database.
SQLalchemy was used to create an engine; the engine takes in a string that indicates database dialect and connection arguments. The string that the engine has it the url to connect to the database in postgreSQL.

##### Convert dataframes to SQL tables

In [24]:
# define a function that will take in a dataframe and a table_name 
# function connect tp postgres through psycopg2, creates a sqlalchemy engine
# and uses the parameters to create a table in the audio_data database
# using the to_sql function

def create_table(df, table_name):
    try:
        #connect to postgres through psycopg2
        conn = psycopg2.connect(host="localhost", 
                                dbname="audio_data", 
                                user="postgres", 
                                password=password)
        
        #create an engine to communicate with postgres
        postgres_str = f'postgresql+psycopg2://postgres:'+password+'@localhost:5432/audio_data'
        engine = create_engine(postgres_str)

        #use the to_sql function to create a table 
        df.to_sql(table_name, con=engine, index=False, if_exists='replace')
        
        #verify that table was created
        return engine.table_names()
        
    # raise errors in connection or function
    except Exception as error:
        print(error)
    
    #close connection and engine if success or error
    finally:
        conn.close()
        engine.dispose

In [26]:
#create table containing all data
create_table(audio_df, 'audio')
create_table(artist_df,'artist')
create_table(info_df, 'artist_info')
create_table(location_df, 'location')

#NOTE TO SELF-->LOCATION_INFO HAS BEEN DELETED EVEN THO IT IS OUTPUTTED BELOW

/var/folders/jl/_v7nhy4x6ns_kxmg8nxmzggr0000gn/T/ipykernel_67304/3773695769.py:22: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  return engine.table_names()

['audio',
 'newtable',
 'band_10yrs',
 'artist',
 'artist_info',
 'location_info',
 'location']

The code below is a list of DDL used to create and or alter the tables. Tables will be created if it does not exist; if the table does exist, the code will not be executed. Specifically, the audio and location table will be altered since they already exist. The artist and artist_info table will be creates.

##### Execute DDL commands

In [27]:
DDL_queries = [
    #audio table DDL
    "ALTER TABLE audio ALTER COLUMN artist_id TYPE integer USING artist_id::integer;",
    "ALTER TABLE audio ALTER COLUMN year_formed TYPE integer USING year_formed::integer;",
    "ALTER TABLE artist ALTER COLUMN artist_id SET NOT NULL;",
    
    #location_info table DDL
    "ALTER TABLE location_info ALTER COLUMN country_code SET NOT NULL;",
    "ALTER TABLE location_info DROP CONSTRAINT IF EXISTS location_info_pkey;",
    "ALTER TABLE location_info ADD PRIMARY KEY (country_code);",
    
    #artist table DDL
    "CREATE TABLE IF NOT EXISTS artist AS SELECT artist_id, artist_name, gender, member_count FROM audio;",  
    "ALTER TABLE artist DROP CONSTRAINT IF EXISTS artist_pkey;",
    "ALTER TABLE artist ADD PRIMARY KEY (artist_id);",

    #artist_info table DDL
    "CREATE TABLE IF NOT EXISTS artist_info AS SELECT artist_id, country_code, genre, year_formed, year_disbanded, label FROM audio;",
    "ALTER TABLE artist_info DROP CONSTRAINT IF EXISTS artist_info_pkey;",
    "ALTER TABLE artist_info ADD PRIMARY KEY (artist_id);",
    "ALTER TABLE artist_info ALTER COLUMN member_count TYPE integer USING (member_count::integer);", 
    #drop redundant audio table
    "DROP TABLE IF EXISTS audio;"
   ]

A for loop is inserted inside the function that connects to postgres through psycopg2 with the necessary parameters (host, dbname, user, password). The for loop takes in the DDL_queries list to create and alter the tables. Try and except has been added to print an error if a table cannot be executed. If the for loop is successful or if there is an error, the connection, cursor, and engine will close.

In [28]:
cur = None
conn = None

#connect to postgres through psycopg2
try:
    conn = psycopg2.connect(host="localhost", 
                            dbname="audio_data", 
                            user="postgres", 
                            password=password)

    #create cursor to give commands to postgres
    cur = conn.cursor()
    
    #create a loop to execute each DDL 
    for query in DDL_queries:
        
        #execute each query in DDL_queries list
        cur.execute(query)
        
        #string explanation 
        print('execute '+query)
        
    
    conn.commit()
    print('queries committed')
    
# raise errors in connection or function
except Exception as error:
    print(error)

#close cursor, connection and engine if success or error
finally:
    if cur is not None:
        cur.close()
        print('cursor closed')
    if conn is not None:
        conn.close()
        print('connection closed')

execute ALTER TABLE audio ALTER COLUMN artist_id TYPE integer USING artist_id::integer;
execute ALTER TABLE audio ALTER COLUMN year_formed TYPE integer USING year_formed::integer;
execute ALTER TABLE artist ALTER COLUMN artist_id SET NOT NULL;
relation "location_info" does not exist

cursor closed
connection closed

##### Execute DML commands


The code below consist of strings within variables which will later act as the SQL queries in the kernals that follow. DML used to manipulate rather than create data (as seen above) The exception is variable 'query2_3' which consists of a DDL query which will aid in the DML queries that follow.

In [59]:
query1 = "SELECT country_name, genre, COUNT(genre) AS genre_count FROM location INNER JOIN artist_info ON location.country_code = artist_info.country_code GROUP BY genre, country_name ORDER BY genre_count DESC;"



#     query2_1 = "SELECT * INTO newtable FROM artist_info WHERE year_formed NOT LIKE 'None' AND member_count NOT LIKE 'None';"
#     query2_2 = "ALTER TABLE newtable ALTER COLUMN year_formed TYPE integer USING (year_formed::integer);"

query2_3 = "ALTER TABLE artist_info ALTER COLUMN member_count TYPE integer USING member_count::integer;"
query2_4 = "SELECT COUNT(year_formed) AS year_count INTO newtable FROM artist_info WHERE member_count > 1 AND year_formed BETWEEN 2009 AND 2019 GROUP BY year_formed;" 

query2_5 = "SELECT AVG(year_count) FROM newtable;"  #3.8
query2_6 = "SELECT COUNT(year_formed) AS count_2020 FROM artist_info WHERE member_count > 1 AND year_formed = 2020;"



query3 = "SELECT DISTINCT artist_name, year_formed FROM artist INNER JOIN artist_info ON artist.artist_id = artist_info.artist_id WHERE year_formed BETWEEN 1990 AND 1999 ORDER BY year_formed DESC;"

In [60]:
#establish connection through psycopg2
conn = psycopg2.connect(host="localhost", 
                        dbname="audio_data", 
                        user="postgres", 
                        password=password)

#create cursor to give commands to postgres
cur = conn.cursor()

##### Query 1:

After the connection is established through the fucntion above, we are ready to execute the SQL queries in the variables. In the next few executions, we have simply called on the variable name. Where there is a neccessary output, we choose to fetch the results through the cur.fetchall() command. This is followed by the creation and display of the dataframe.

In [34]:
#execute each query in DML_queries list
cur.execute(query1)

#fetch results and store in results variable
results_query1 = cur.fetchall()

#create and display data frame
query1_df = pd.DataFrame(results_query1, columns = ['country_name', 'genre', 'genre_count'])
display(query1_df)

                                          country_name   genre  genre_count
0                       United States of America (the)    None          110
1    United Kingdom of Great Britain and Northern I...    None           32
2                                              Germany    None           26
3                                               France    None           20
4                       United States of America (the)    Jazz           20
..                                                 ...     ...          ...
356                                  Netherlands (the)   Blues            1
357  United Kingdom of Great Britain and Northern I...   Grime            1
358                     United States of America (the)   Opera            1
359                           Russian Federation (the)   Dance            1
360                                              Spain  Techno            1

[361 rows x 3 columns]

#### Query 2:

The code below is a DDL code and has no neccesary output therefore we do not need the fetch command.

In [61]:
#execute each query in DDL_queries list
cur.execute(query2_3)

In [62]:
cur.execute(query2_4)


#DID NOT HAVE TO DO A FETCH
    #fetch results and store in results variable 
    #results_query2 = cur.fetchall()

In [63]:
#create and display data frame
query2_4df = pd.DataFrame(results_query2, columns = ['year_count'])
display(query2_4df)

   year_count
0           7
1          10
2           7
3           2
4           2
5           3
6           1
7           3
8           2
9           1

#### AVERAGE FORMULATION OF BANDS FROM 2009-2019 -- ABOUT 4 BANDS PER YEAR

In [64]:
cur.execute(query2_5)

#fetch results and store in results variable
results_query2_5 = cur.fetchall()

#create and display data frame
query2_5df = pd.DataFrame(results_query2_5, columns = ['year_count'])
display(query2_5df)

           year_count
0  3.8000000000000000

#### AVERAGE FORMULATION OF BANDS IN 2020 -- 2 BANDS

In [65]:
#execute each query in DDL_queries list
cur.execute(query2_6)

#fetch results and store in results variable
results_query2_6 = cur.fetchall()

#create and display data frame
query2_6df = pd.DataFrame(results_query2_6, columns = ['count_2020'])
display(query2_6df)

   count_2020
0           2

##### Query 3:

In [58]:
#execute each query in DDL_queries list
cur.execute(query3)

#fetch results and store in results variable
results_query3 = cur.fetchall()

#create and display data frame
query3_df = pd.DataFrame(results_query3, columns = ['artist_name', 'year_formed'])
display(query3_df)

                  artist_name  year_formed
0                    D-Ground         1999
1                 Simple Plan         1999
2                      Eiffel         1998
3                Neuroticfish         1998
4             Digital Leather         1997
5                        INOJ         1997
6                 Le Balentes         1997
7                Sons of Funk         1997
8              Flipmode Squad         1996
9                       Orion         1996
10        Peter Pan Speedrock         1996
11                        OTT         1995
12            Blood for Blood         1994
13        Violent Work of Art         1994
14               muff potter.         1993
15                  Jestofunk         1992
16                       東山奈央         1992
17          Sálvate si puedes         1990
18  The Lord Weird Slough Feg         1990

##### Query 4:

##### Query 5:

In [60]:
conn.close()
cur.close()

In [ ]:
### Working on making this a loop, but it might not be worth it -AS

In [52]:
DML_queries = [query1, query2, query3]

cur = None
conn = None

#connect to postgres through psycopg2
try:
    conn = psycopg2.connect(host="localhost", 
                            dbname="audio_data", 
                            user="postgres", 
                            password=password)

    #create cursor to give commands to postgres
    cur = conn.cursor()
    
    #create a loop to execute each DDL 
    for query in DML_queries:
        
        #execute each query in DDL_queries list
        cur.execute(query)
        
        #string explanation 
        print('execute '+ query)
        print(' ')
        
        #fetch results and store in results variable
        results_query = cur.fetchall()

        query_df = pd.DataFrame(results_query)
        display(query_df)
    
    conn.commit()
    print('queries committed')
    
# raise errors in connection or function
except Exception as error:
    print(error)

#close cursor, connection and engine if success or error
finally:
    if cur is not None:
        cur.close()
        print('cursor closed')
    if conn is not None:
        conn.close()
        print('connection closed')

execute SELECT country_name, genre, COUNT(genre) AS genre_count FROM location_info INNER JOIN artist_info ON location_info.country_code = artist_info.country_code GROUP BY genre, country_name ORDER BY genre_count DESC;

                                 0                 1   2
0   United States of America (the)              None  11
1                Netherlands (the)              None   4
2                           France              None   3
3                            Italy              None   3
4   United States of America (the)           Hip-Hop   3
..                             ...               ...  ..
64                          Norway              Jazz   1
65        Russian Federation (the)              None   1
66                           Italy             Indie   1
67  United States of America (the)       Heavy Metal   1
68                          Sweden  Industrial Metal   1

[69 rows x 3 columns]

execute SELECT COUNT(artist_name) AS artist_count, year_formed FROM artist INNER JOIN artist_info ON artist.artist_id = artist_info.artist_id GROUP BY year_formed ORDER BY artist_count DESC;

     0     1
0   38     0
1    4  2010
2    4  1997
3    4  2002
4    3  2006
5    3  1996
6    2  1994
7    2  1989
8    2  1967
9    2  2005
10   2  1990
11   2  1998
12   2  2007
13   2  1981
14   2  1979
15   2  1999
16   2  1970
17   2  1986
18   2  1992
19   2  1969
20   1  1993
21   1  1950
22   1  1955
23   1  1976
24   1  1995
25   1  1964
26   1  1927
27   1  2000
28   1  1982
29   1  1944
30   1  1971
31   1  2014
32   1  2020
33   1  1962
34   1  2001
35   1  2016
36   1  2011
37   1  1965
38   1  1940
39   1  1984
40   1  1983
41   1  1949
42   1  1649
43   1  1959
44   1  1958
45   1  1960
46   1  2015

execute SELECT DISTINCT artist_name, year_formed FROM artist INNER JOIN artist_info ON artist.artist_id = artist_info.artist_id WHERE year_formed BETWEEN 1990 AND 1999 ORDER BY year_formed DESC;

                            0     1
0                    D-Ground  1999
1                 Simple Plan  1999
2                      Eiffel  1998
3                Neuroticfish  1998
4             Digital Leather  1997
5                        INOJ  1997
6                 Le Balentes  1997
7                Sons of Funk  1997
8              Flipmode Squad  1996
9                       Orion  1996
10        Peter Pan Speedrock  1996
11                        OTT  1995
12            Blood for Blood  1994
13        Violent Work of Art  1994
14               muff potter.  1993
15                  Jestofunk  1992
16                       東山奈央  1992
17          Sálvate si puedes  1990
18  The Lord Weird Slough Feg  1990

queries committed
cursor closed
connection closed

In [48]:
column_names = {query1:['A','B','C'], query2:['A', 'B'], query3:['A', 'B']}

for key,values in column_names:
    #display(key_df, columns = value)
    print(key, values)

ValueError: too many values to unpack (expected 2)